Tekla Open API Reference for Tekla Structures 2025
Double Implicit Conversion Operators
Overload List
Name | Description
Implicit(Double to Double)
 Converts from double to Datatype.Double.
Implicit(Double to Double)
 Converts from Datatype.Double to double.
Top
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace